app/controllers/dishes_controller.rb

    def index
        render  json: Dish.all
---
SELECT "dishes".* FROM "dishes"

    def chef_dishes
        chef= User.find(params[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]