app/controllers/events_controller.rb

    def index
        render json: Event.all
---
SELECT "events".* FROM "events"

    def show
        event = Event.find(params[:id])
---
SELECT "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def create
        date = params[:date] #format [M, "dd", "yyyy"] - seeds => date format (yyyy,mm,dd)
        event = Event.create(ocassion: params[:ocassion], party_size: params[:party_size], date: Date.new(date[2].to_i,date[0],date[1].to_i), dish_name: params[:dish_name], chef_id: params[:chef_id], customer_id: params[:customer_id])
---
INSERT INTO "events" ("party_size", "date", "ocassion", "chef_id", "customer_id", "dish_name") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["party_size", 6], ["date", "2020-07-02"], ["ocassion", "Ladies Night"], ["chef_id", 4], ["customer_id", 5], ["dish_name", "Sushi"]]

    def update
       # byebug
        event = Event.find(params[:id])
        event.update(isApproved: params[:is_approved])
---
SELECT "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "events" SET "isApproved" = $1 WHERE "events"."id" = $2  [["isApproved", true], ["id", 2]]

    def destroy
        event = Event.find(params[:id])
        event.destroy
---
SELECT "events".* FROM "events" WHERE "events"."id" = $1 LIMIT $2  [["id", 6], ["LIMIT", 1]]
DELETE FROM "events" WHERE "events"."id" = $1  [["id", 6]]