app/controllers/users_controller.rb

SELECT "users".* FROM "users"
---
    def chefs_index
        chefs = User.all.select{|user| user.is_chef == true}

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT "events".* FROM "events" WHERE "events"."customer_id" = $1  [["customer_id", 29]]
---
    def user_events #only events for customer_id
        user = User.find(params[:user_id])
        events = Event.all.where(customer_id: user.id)

SELECT "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "events".* FROM "events" WHERE "events"."chef_id" = $1  [["chef_id", 32]]
---
    def chef_events #only events for chef_id
        user = User.find(params[:id])
        events = Event.all.where(chef_id: user.id)